DataProcessors/ГИГ_ПодборЭтаповПроизводства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<DataProcessor>
		<Properties>
			<Name>ГИГ_ПодборЭтаповПроизводства</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>ПодобранныеЭтапы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Этап</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ЭтапПроизводства2_2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Продукция</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>450</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидРабот</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыРаботСотрудников</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВремени</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыИспользованияРабочегоВремени</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНачалаРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОкончанияРаботы</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоЧасов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособКомпенсацииПереработки</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СпособыКомпенсацииПереработки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сотрудники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ГИГ_ПодборЭтаповПроизводства/Forms/ЗапросКоличестваОтработанногоВремени/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	ВидРабот = Параметры.ВидРабот;
	День = Параметры.День;
	
	ВремяНачалаРаботы = День;
	ВремяОкончанияРаботы = День;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ВремяНачалаРаботыПриИзменении(Элемент)
	КоличествоЧасов = ГИГ_ЕжедневнаяВыработкаКлиент.РассчитатьКоличествоЧасовВыработки(День, ВремяНачалаРаботы, ВремяОкончанияРаботы);
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияРаботыПриИзменении(Элемент)
	КоличествоЧасов = ГИГ_ЕжедневнаяВыработкаКлиент.РассчитатьКоличествоЧасовВыработки(День, ВремяНачалаРаботы, ВремяОкончанияРаботы);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОК(Команда)
	Результат = Новый Структура("ВидВремени, ВремяНачалаРаботы, ВремяОкончанияРаботы, КоличествоЧасов", ВидВремени, ВремяНачалаРаботы, ВремяОкончанияРаботы, КоличествоЧасов);
	Закрыть(Результат);
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	Закрыть(Неопределено);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
